[Killed] StringLiteral
app/gilded-rose.ts:16:38
 export class GildedRose {
   private static readonly AGED_BRIE = 'Aged Brie';
   private static readonly BACKSTAGE_PASS = 'Backstage passes to a TAFKAL80ETC concert';
-  private static readonly SULFURAS = 'Sulfuras, Hand of Ragnaros';
+  private static readonly SULFURAS = "";
 
   constructor(private readonly items: Item[] = []) {}
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 60
+ Received  + 60

@@ -14,360 +14,360 @@

[Killed] ArrayDeclaration
app/gilded-rose.ts:18:48
   private static readonly BACKSTAGE_PASS = 'Backstage passes to a TAFKAL80ETC concert';
   private static readonly SULFURAS = 'Sulfuras, Hand of Ragnaros';
 
-  constructor(private readonly items: Item[] = []) {}
+  constructor(private readonly items: Item[] = ["Stryker was here"]) {}
 
   public updateQuality(): Item[] {
killedBy: GildedRose deve retornar array vazio quando inicializado sem itens
statusReason: TypeError: Cannot create property 'sellIn' on string 'Stryker was here'

[Killed] BlockStatement
app/gilded-rose.ts:20:34
 
   constructor(private readonly items: Item[] = []) {}
 
-  public updateQuality(): Item[] {
-    for (const item of this.items) {
-      this.updateItem(item);
-    }
-
-    return this.items;
-  }
+  public updateQuality(): Item[] {}
 
   private updateItem(item: Item): void {
killedBy: GildedRose deve diminuir quality e sellIn de um item comum antes da data de venda
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
app/gilded-rose.ts:21:36
   constructor(private readonly items: Item[] = []) {}
 
   public updateQuality(): Item[] {
-    for (const item of this.items) {
-      this.updateItem(item);
-    }
+    for (const item of this.items) {}
 
     return this.items;
killedBy: GildedRose deve diminuir quality e sellIn de um item comum antes da data de venda
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 10

[Killed] BlockStatement
app/gilded-rose.ts:28:40
     return this.items;
   }
 
-  private updateItem(item: Item): void {
-    if (this.isLegendary(item)) {
-      // "Sulfuras" nunca altera qualidade nem sellIn
-      return;
-    }
-
-    this.updateQualityBeforeSellIn(item);
-    this.decreaseSellIn(item);
-    this.updateQualityAfterSellIn(item);
-  }
+  private updateItem(item: Item): void {}
 
   // --- Regras antes da data de venda ---
killedBy: GildedRose deve diminuir quality e sellIn de um item comum antes da data de venda
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 10

[Killed] ConditionalExpression
app/gilded-rose.ts:29:9
   }
 
   private updateItem(item: Item): void {
-    if (this.isLegendary(item)) {
+    if (true) {
       // "Sulfuras" nunca altera qualidade nem sellIn
       return;
killedBy: GildedRose deve diminuir quality e sellIn de um item comum antes da data de venda
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 10

[Killed] BlockStatement
app/gilded-rose.ts:29:33
   }
 
   private updateItem(item: Item): void {
-    if (this.isLegendary(item)) {
-      // "Sulfuras" nunca altera qualidade nem sellIn
-      return;
-    }
+    if (this.isLegendary(item)) {}
 
     this.updateQualityBeforeSellIn(item);
killedBy: GildedRose Sulfuras não deve alterar quality nem sellIn
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -1

[Killed] BlockStatement
app/gilded-rose.ts:41:55
 
   // --- Regras antes da data de venda ---
 
-  private updateQualityBeforeSellIn(item: Item): void {
-    if (this.isAgedBrie(item)) {
-      this.increaseQuality(item);
-      return;
-    }
-
-    if (this.isBackstagePass(item)) {
-      this.handleBackstageBeforeSellIn(item);
-      return;
-    }
-
-    // item comum
-    this.decreaseQuality(item);
-  }
+  private updateQualityBeforeSellIn(item: Item): void {}
 
   private handleBackstageBeforeSellIn(item: Item): void {
killedBy: GildedRose deve diminuir quality e sellIn de um item comum antes da data de venda
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 19
Received: 20

[Killed] ConditionalExpression
app/gilded-rose.ts:42:9
   // --- Regras antes da data de venda ---
 
   private updateQualityBeforeSellIn(item: Item): void {
-    if (this.isAgedBrie(item)) {
+    if (true) {
       this.increaseQuality(item);
       return;
killedBy: GildedRose deve diminuir quality e sellIn de um item comum antes da data de venda
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 19
Received: 21

[Killed] BlockStatement
app/gilded-rose.ts:42:32
   // --- Regras antes da data de venda ---
 
   private updateQualityBeforeSellIn(item: Item): void {
-    if (this.isAgedBrie(item)) {
-      this.increaseQuality(item);
-      return;
-    }
+    if (this.isAgedBrie(item)) {}
 
     if (this.isBackstagePass(item)) {
killedBy: GildedRose Aged Brie deve aumentar quality enquanto se aproxima da data de venda
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 11
Received: 9

[Killed] ConditionalExpression
app/gilded-rose.ts:47:9
       return;
     }
 
-    if (this.isBackstagePass(item)) {
+    if (false) {
       this.handleBackstageBeforeSellIn(item);
       return;
killedBy: GildedRose Backstage passes deve aumentar quality em 1 quando faltam mais de 10 dias
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 21
Received: 19

[Killed] ConditionalExpression
app/gilded-rose.ts:47:9
       return;
     }
 
-    if (this.isBackstagePass(item)) {
+    if (true) {
       this.handleBackstageBeforeSellIn(item);
       return;
killedBy: GildedRose deve diminuir quality e sellIn de um item comum antes da data de venda
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 19
Received: 22

[Killed] BlockStatement
app/gilded-rose.ts:56:57
     this.decreaseQuality(item);
   }
 
-  private handleBackstageBeforeSellIn(item: Item): void {
-    this.increaseQuality(item);
-
-    if (item.sellIn < 11) {
-      this.increaseQuality(item);
-    }
-
-    if (item.sellIn < 6) {
-      this.increaseQuality(item);
-    }
-  }
+  private handleBackstageBeforeSellIn(item: Item): void {}
 
   // --- Regras após a data de venda (sellIn < 0 após decremento) ---
killedBy: GildedRose Backstage passes deve aumentar quality em 1 quando faltam mais de 10 dias
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 21
Received: 20

[Killed] BlockStatement
app/gilded-rose.ts:59:27
   private handleBackstageBeforeSellIn(item: Item): void {
     this.increaseQuality(item);
 
-    if (item.sellIn < 11) {
-      this.increaseQuality(item);
-    }
+    if (item.sellIn < 11) {}
 
     if (item.sellIn < 6) {
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 10
+ Received  + 10

@@ -76,11 +76,11 @@

[Killed] ConditionalExpression
app/gilded-rose.ts:59:9
   private handleBackstageBeforeSellIn(item: Item): void {
     this.increaseQuality(item);
 
-    if (item.sellIn < 11) {
+    if (true) {
       this.increaseQuality(item);
     }
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 14
+ Received  + 14

@@ -16,11 +16,11 @@

[Killed] BlockStatement
app/gilded-rose.ts:63:26
       this.increaseQuality(item);
     }
 
-    if (item.sellIn < 6) {
-      this.increaseQuality(item);
-    }
+    if (item.sellIn < 6) {}
   }
 
killedBy: GildedRose Backstage passes deve aumentar quality em 3 quando faltam 5 dias ou menos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 23
Received: 22

[Killed] EqualityOperator
app/gilded-rose.ts:63:9
       this.increaseQuality(item);
     }
 
-    if (item.sellIn < 6) {
+    if (item.sellIn <= 6) {
       this.increaseQuality(item);
     }
killedBy: GildedRose Backstage passes deve aumentar quality em 2 quando faltam exatamente 6 dias
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 22
Received: 23

[Killed] BlockStatement
app/gilded-rose.ts:70:54
 
   // --- Regras após a data de venda (sellIn < 0 após decremento) ---
 
-  private updateQualityAfterSellIn(item: Item): void {
-    if (item.sellIn >= 0) {
-      return;
-    }
-
-    if (this.isAgedBrie(item)) {
-      this.increaseQuality(item);
-      return;
-    }
-
-    if (this.isBackstagePass(item)) {
-      // Após o show, o valor cai para zero
-      item.quality = 0;
-      return;
-    }
-
-    // item comum após expirar degrada novamente
-    this.decreaseQuality(item);
-  }
+  private updateQualityAfterSellIn(item: Item): void {}
 
   // --- Helpers de domínio ---
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 100
+ Received  + 100

@@ -36,11 +36,11 @@

[Killed] ConditionalExpression
app/gilded-rose.ts:71:9
   // --- Regras após a data de venda (sellIn < 0 após decremento) ---
 
   private updateQualityAfterSellIn(item: Item): void {
-    if (item.sellIn >= 0) {
+    if (true) {
       return;
     }
killedBy: GildedRose deve degradar quality de item comum duas vezes mais rápido após a data de venda
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 9

[Killed] ConditionalExpression
app/gilded-rose.ts:71:9
   // --- Regras após a data de venda (sellIn < 0 após decremento) ---
 
   private updateQualityAfterSellIn(item: Item): void {
-    if (item.sellIn >= 0) {
+    if (false) {
       return;
     }
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 78
+ Received  + 78

@@ -11,192 +11,192 @@

[Killed] BlockStatement
app/gilded-rose.ts:75:32
       return;
     }
 
-    if (this.isAgedBrie(item)) {
-      this.increaseQuality(item);
-      return;
-    }
+    if (this.isAgedBrie(item)) {}
 
     if (this.isBackstagePass(item)) {
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 28
+ Received  + 28

@@ -36,11 +36,11 @@

[Killed] ConditionalExpression
app/gilded-rose.ts:75:9
       return;
     }
 
-    if (this.isAgedBrie(item)) {
+    if (false) {
       this.increaseQuality(item);
       return;
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 28
+ Received  + 28

@@ -36,11 +36,11 @@

[Killed] BlockStatement
app/gilded-rose.ts:80:37
       return;
     }
 
-    if (this.isBackstagePass(item)) {
-      // Após o show, o valor cai para zero
-      item.quality = 0;
-      return;
-    }
+    if (this.isBackstagePass(item)) {}
 
     // item comum após expirar degrada novamente
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 60
+ Received  + 60

@@ -78,11 +78,11 @@

[Killed] BlockStatement
app/gilded-rose.ts:92:45
 
   // --- Helpers de domínio ---
 
-  private increaseQuality(item: Item): void {
-    if (item.quality < 50) {
-      item.quality += 1;
-    }
-  }
+  private increaseQuality(item: Item): void {}
 
   private decreaseQuality(item: Item): void {
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 60
+ Received  + 60

@@ -12,191 +12,191 @@

[Killed] ConditionalExpression
app/gilded-rose.ts:93:9
   // --- Helpers de domínio ---
 
   private increaseQuality(item: Item): void {
-    if (item.quality < 50) {
+    if (false) {
       item.quality += 1;
     }
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 60
+ Received  + 60

@@ -12,191 +12,191 @@

[Killed] EqualityOperator
app/gilded-rose.ts:93:9
   // --- Helpers de domínio ---
 
   private increaseQuality(item: Item): void {
-    if (item.quality < 50) {
+    if (item.quality >= 50) {
       item.quality += 1;
     }
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 60
+ Received  + 60

@@ -12,191 +12,191 @@

[Killed] AssignmentOperator
app/gilded-rose.ts:94:7
 
   private increaseQuality(item: Item): void {
     if (item.quality < 50) {
-      item.quality += 1;
+      item.quality -= 1;
     }
   }
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 60
+ Received  + 60

@@ -12,191 +12,191 @@

[Killed] BlockStatement
app/gilded-rose.ts:98:45
     }
   }
 
-  private decreaseQuality(item: Item): void {
-    if (item.quality > 0) {
-      item.quality -= 1;
-    }
-  }
+  private decreaseQuality(item: Item): void {}
 
   private decreaseSellIn(item: Item): void {
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 90
+ Received  + 90

@@ -11,364 +11,364 @@

[Killed] ConditionalExpression
app/gilded-rose.ts:99:9
   }
 
   private decreaseQuality(item: Item): void {
-    if (item.quality > 0) {
+    if (false) {
       item.quality -= 1;
     }
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 90
+ Received  + 90

@@ -11,364 +11,364 @@

[Killed] ConditionalExpression
app/gilded-rose.ts:99:9
   }
 
   private decreaseQuality(item: Item): void {
-    if (item.quality > 0) {
+    if (true) {
       item.quality -= 1;
     }
killedBy: Gilded Rose Approval should foo
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should foo 1`

- Snapshot  - 1
+ Received  + 1

  [

[Killed] AssignmentOperator
app/gilded-rose.ts:100:7
 
   private decreaseQuality(item: Item): void {
     if (item.quality > 0) {
-      item.quality -= 1;
+      item.quality += 1;
     }
   }
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 90
+ Received  + 90

@@ -11,364 +11,364 @@

[Killed] BlockStatement
app/gilded-rose.ts:104:44
     }
   }
 
-  private decreaseSellIn(item: Item): void {
-    item.sellIn -= 1;
-  }
+  private decreaseSellIn(item: Item): void {}
 
   private isAgedBrie(item: Item): boolean {
killedBy: Gilded Rose Approval should foo
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should foo 1`

- Snapshot  - 1
+ Received  + 1

  [

[Killed] AssignmentOperator
app/gilded-rose.ts:105:5
   }
 
   private decreaseSellIn(item: Item): void {
-    item.sellIn -= 1;
+    item.sellIn += 1;
   }
 
killedBy: Gilded Rose Approval should foo
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should foo 1`

- Snapshot  - 1
+ Received  + 1

  [

[Killed] BlockStatement
app/gilded-rose.ts:108:43
     item.sellIn -= 1;
   }
 
-  private isAgedBrie(item: Item): boolean {
-    return item.name === GildedRose.AGED_BRIE;
-  }
+  private isAgedBrie(item: Item): boolean {}
 
   private isBackstagePass(item: Item): boolean {
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 30
+ Received  + 30

@@ -12,11 +12,11 @@

[Killed] ConditionalExpression
app/gilded-rose.ts:109:12
   }
 
   private isAgedBrie(item: Item): boolean {
-    return item.name === GildedRose.AGED_BRIE;
+    return true;
   }
 
killedBy: Gilded Rose Approval should foo
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should foo 1`

- Snapshot  - 1
+ Received  + 1

  [

[Killed] EqualityOperator
app/gilded-rose.ts:109:12
   }
 
   private isAgedBrie(item: Item): boolean {
-    return item.name === GildedRose.AGED_BRIE;
+    return item.name !== GildedRose.AGED_BRIE;
   }
 
killedBy: Gilded Rose Approval should foo
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should foo 1`

- Snapshot  - 1
+ Received  + 1

  [

[Killed] BlockStatement
app/gilded-rose.ts:112:48
     return item.name === GildedRose.AGED_BRIE;
   }
 
-  private isBackstagePass(item: Item): boolean {
-    return item.name === GildedRose.BACKSTAGE_PASS;
-  }
+  private isBackstagePass(item: Item): boolean {}
 
   private isLegendary(item: Item): boolean {
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 72
+ Received  + 72

@@ -16,324 +16,324 @@

[Killed] ConditionalExpression
app/gilded-rose.ts:113:12
   }
 
   private isBackstagePass(item: Item): boolean {
-    return item.name === GildedRose.BACKSTAGE_PASS;
+    return true;
   }
 
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 23
+ Received  + 23

@@ -11,71 +11,71 @@

[Killed] EqualityOperator
app/gilded-rose.ts:113:12
   }
 
   private isBackstagePass(item: Item): boolean {
-    return item.name === GildedRose.BACKSTAGE_PASS;
+    return item.name !== GildedRose.BACKSTAGE_PASS;
   }
 
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 95
+ Received  + 95

@@ -11,329 +11,329 @@

[Killed] BlockStatement
app/gilded-rose.ts:116:44
     return item.name === GildedRose.BACKSTAGE_PASS;
   }
 
-  private isLegendary(item: Item): boolean {
-    return item.name === GildedRose.SULFURAS;
-  }
+  private isLegendary(item: Item): boolean {}
 }
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 60
+ Received  + 60

@@ -14,360 +14,360 @@

[Killed] ConditionalExpression
app/gilded-rose.ts:117:12
   }
 
   private isLegendary(item: Item): boolean {
-    return item.name === GildedRose.SULFURAS;
+    return false;
   }
 }
killedBy: Gilded Rose Approval should thirtyDays
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should thirtyDays 1`

- Snapshot  - 60
+ Received  + 60

@@ -14,360 +14,360 @@

[Killed] ConditionalExpression
app/gilded-rose.ts:117:12
   }
 
   private isLegendary(item: Item): boolean {
-    return item.name === GildedRose.SULFURAS;
+    return true;
   }
 }
killedBy: Gilded Rose Approval should foo
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Gilded Rose Approval should foo 1`

- Snapshot  - 1
+ Received  + 1

  [
